In [1]:
import pandas as pd

data = pd.read_csv('pandas_input.csv')
data.head()

       Name  Age  Height
0  Vihaan R   23     191
1  Rachel G   35     165
2    Shiv G   19     180
3    John L   50     185
4  Shreya H   21     160

##### We have another dataframe of scores, for these participants. We want to add these scores to the original dataframe, but the scores dataframe is sorted by names, and doesn't have initial of the Last name

In [2]:
scores = pd.read_csv('pandas_scores.csv')
scores.head()

       name  score
0  Amandeep     89
1     Amina     88
2   Harshit     91
3      John     88
4   Mustafa     88

##### Now to add the respective scores, we will first need to sort the original dataframe based on name.

In [3]:
sorted = data.sort_values(by='Name')
sorted['score'] = scores['score']
sorted.head()

         Name  Age  Height  score
6  Amandeep S   32     193     89
8     Amina S   27     156     90
7   Harshit L   44     179     92
3      John L   50     185     88
5   Mustafa C   29     175     85

##### We see that the scores do not match.

##### The reason for this is : 
- The copying of a column from one dataframe to another happens based on indexes (ie value in df1 at index 1 is copied to value in df2 at index 1 and so on.) and 
- Even after sorting the original data retained it's index.
- Basically in scores df, Harshit is at index 2, whereas in sorted df (same as data df), Harshit is at index 7
- To solve this, we need to pass ignore_index parameter as true.

In [4]:
sorted_new = data.sort_values(by='Name', ignore_index=True)
sorted_new['score'] = scores['score']
sorted_new.head()

         Name  Age  Height  score
0  Amandeep S   32     193     89
1     Amina S   27     156     88
2   Harshit L   44     179     91
3      John L   50     185     88
4   Mustafa C   29     175     88